app/controllers/api/v1/reviews_controller.rb

	def index
		shop = Shop.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		review = Review.new(review_params)
		review.shop = Shop.find(params[:shop_id])
		review.user = current_user

		if review.save
			render json: review
		else
			render json: {error: review.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shop_id" = $1  [["shop_id", 1]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "shop_id", "donut_review", "coffee_review", "shop_review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "shops".* FROM "shops"
SELECT "users".* FROM "users"