app/controllers/api/v1/shops_controller.rb

 	def index
		render json: Shop.all
---
SELECT "shops".* FROM "shops"

	def show
		shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]